#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `failure`

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.database: Reading...
data.terraform_remote_state.infra: Reading...
data.archive_file.lambda_login_artefact: Reading...
data.terraform_remote_state.database: Read complete after 0s
data.terraform_remote_state.infra: Read complete after 0s
data.aws_iam_policy_document.assume_role_lambda: Reading...
data.aws_iam_policy_document.assume_role_lambda: Read complete after 0s [id=2690255455]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_api_gateway_method.default will be created
  + resource "aws_api_gateway_method" "default" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method_response.proxy will be created
  + resource "aws_api_gateway_method_response" "proxy" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # aws_api_gateway_resource.default will be created
  + resource "aws_api_gateway_resource" "default" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "login"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.default will be created
  + resource "aws_api_gateway_rest_api" "default" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Fiap API Gateway"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "fiap-irango-api-gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "Name" = "fiap-irango-api-gateway"
        }
      + tags_all                     = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-api-gateway"
          + "Service"     = "fiap-irango"
        }

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "fiap-irango-lambda-login"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
    }

  # aws_cognito_user_pool.default will be created
  + resource "aws_cognito_user_pool" "default" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "fiap-irango-cognito-user-pool"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Name" = "fiap-irango-cognito-user-pool"
        }
      + tags_all                   = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-cognito-user-pool"
          + "Service"     = "fiap-irango"
        }
      + username_attributes        = [
          + "email",
        ]

      + password_policy {
          + minimum_length    = 11
          + require_lowercase = false
          + require_numbers   = false
          + require_symbols   = false
          + require_uppercase = false
        }

      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "cpf"
          + required                 = false

          + string_attribute_constraints {
              + max_length = "11"
              + min_length = "11"
            }
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "email"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "1"
            }
        }

      + username_configuration {
          + case_sensitive = false
        }
    }

  # aws_cognito_user_pool_client.default will be created
  + resource "aws_cognito_user_pool_client" "default" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
        ]
      + generate_secret                               = false
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "fiap-irango-cognito-user-pool-client"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 90
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)
    }

  # aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fiap-irango-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "fiap-irango-lambda"
    }

  # aws_security_group.lambda will be created
  + resource "aws_security_group" "lambda" {
      + arn                    = (known after apply)
      + description            = "inbound: all + outbound: all"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "fiap-irango-security-group-lambda"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "fiap-irango-security-group-lambda"
        }
      + tags_all               = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-security-group-lambda"
          + "Service"     = "fiap-irango"
        }
      + vpc_id                 = "vpc-0f57070f63664a169"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + client_id    = (known after apply)
  + user_pool_id = (known after apply)

```

</details>